#===================================================================
#        数値参照文字のエンコード・デコード
#-------------------------------------------------------------------
#            (C) 2014 @white_mns
#===================================================================

package NumCode;
use Encode 'from_to';

#-----------------------------------#
#
#        エンコード
#            引数はutf-8とする
#-----------------------------------#
sub Encode{
    (my $content) = @_;
    $content =~ s/&#/"<<>>"/ge;
    $content =~ s/"ー"/"<<1>>"/ge;
    $content =~ s/"～"/"<<2>>"/ge;
    return $content;
}

#-----------------------------------#
#
#        エンコード
#            引数はutf-8とする
#-----------------------------------#
sub EncodeEscape{
    (my $content) = @_;
    $content =~ s/&copy;/"&amp;copy;"/ge;
    $content =~ s/&reg;/"&amp;reg;"/ge;
    $content =~ s/&#/"&amp;#"/ge;
    return $content;
}

#-----------------------------------#
#
#        デコード
#
#-----------------------------------#
sub Decode{
    (my $content) = @_;
    
    my $henkan = "<<>>";
    #from_to($henkan, 'UTF8', 'cp932');
    
    $content =~ s/$henkan/"&#"/ge;
    
    return  $content;
}
1;
